zephyrproject-rtos/hal_nxp/dts/nxp/s32/S32K344_K324_K314_172HDQFP-pinctrl.h
/*
 * Copyright 2023-2026 NXP
 *
 * SPDX-License-Identifier: Apache-2.0
 */

/*
 * Delta-deduplicated by dedup_pinctrl.py:
 * based on S32K344_K324_K314_257BGA-pinctrl.h with this part's differences applied
 * below (395 removed, 0 changed,
 * 0 added). Regenerate with dedup_pinctrl.py;
 * do not edit by hand.
 * target-hash: 12f8105ca85c6145
 */

#ifndef _ZEPHYR_DTS_BINDING_S32K344_K324_K314_172HDQFP_WRAPPER_
#define _ZEPHYR_DTS_BINDING_S32K344_K324_K314_172HDQFP_WRAPPER_

#include "S32K344_K324_K314_257BGA-pinctrl.h"

/* Signals not present on this part */
#undef PTA22_CAN1_RX
#undef PTA22_EMIOS_1_CH4_H_I
#undef PTA22_EMIOS_1_CH4_H_O
#undef PTA22_FXIO_D1_I
#undef PTA22_FXIO_D1_O
#undef PTA22_LPSPI1_PCS1_I
#undef PTA22_LPSPI1_PCS1_O
#undef PTA23_CAN1_TX
#undef PTA23_EMIOS_1_CH6_H_I
#undef PTA23_EMIOS_1_CH6_H_O
#undef PTA23_FXIO_D2_I
#undef PTA23_FXIO_D2_O
#undef PTA26_EMAC_PPS0_I
#undef PTA26_EMAC_PPS0_O
#undef PTA26_EMIOS_1_CH9_H_I
#undef PTA26_EMIOS_1_CH9_H_O
#undef PTA26_EMIOS_2_CH9_H_I
#undef PTA26_EMIOS_2_CH9_H_O
#undef PTA26_FXIO_D1_I
#undef PTA26_FXIO_D1_O
#undef PTA26_LPSPI0_PCS0_I
#undef PTA26_LPSPI0_PCS0_O
#undef PTA26_LPSPI1_PCS0_I
#undef PTA26_LPSPI1_PCS0_O
#undef PTB30_FXIO_D11_I
#undef PTB30_FXIO_D11_O
#undef PTB30_HSE_TAMPER_LOOP_OUT0
#undef PTB31_EIRQ15
#undef PTB31_HSE_TAMPER_EXTIN0
#undef PTC22_EMIOS_0_CH8_X_I
#undef PTC22_EMIOS_0_CH8_X_O
#undef PTD18_CAN2_TX
#undef PTD18_EMIOS_1_CH15_H_I
#undef PTD18_EMIOS_1_CH15_H_O
#undef PTD18_FXIO_D2_I
#undef PTD18_FXIO_D2_O
#undef PTD19_CAN2_RX
#undef PTD19_EMIOS_1_CH16_X_I
#undef PTD19_EMIOS_1_CH16_X_O
#undef PTD19_FXIO_D3_I
#undef PTD19_FXIO_D3_O
#undef PTD25_EMIOS_1_CH22_X_I
#undef PTD25_EMIOS_1_CH22_X_O
#undef PTE19_EMIOS_0_CH22_X_I
#undef PTE19_EMIOS_0_CH22_X_O
#undef PTE20_EMIOS_1_CH0_X_I
#undef PTE20_EMIOS_1_CH0_X_O
#undef PTE27_EMIOS_1_CH7_H_I
#undef PTE27_EMIOS_1_CH7_H_O
#undef PTE28_CAN3_TX
#undef PTE29_CAN3_RX
#undef PTE30_CAN4_TX
#undef PTE30_CMP1_OUT
#undef PTE31_CAN4_RX
#undef PTE31_CMP1_RR_ACTIVES
#undef PTF0_EIRQ0
#undef PTF0_EMIOS_2_CH0_X_I
#undef PTF0_EMIOS_2_CH0_X_O
#undef PTF0_LPSPI2_SCK_I
#undef PTF0_LPSPI2_SCK_O
#undef PTF0_LPUART5_TX_I
#undef PTF0_LPUART5_TX_O
#undef PTF10_ADC0_MA1
#undef PTF10_EIRQ18
#undef PTF10_EMIOS_2_CH10_H_I
#undef PTF10_EMIOS_2_CH10_H_O
#undef PTF11_ADC0_MA2
#undef PTF11_EIRQ19
#undef PTF11_EMIOS_2_CH11_H_I
#undef PTF11_EMIOS_2_CH11_H_O
#undef PTF11_HSE_TAMPER_EXTIN0
#undef PTF12_ADC0_MA0
#undef PTF12_EIRQ20
#undef PTF12_EMIOS_2_CH12_H_I
#undef PTF12_EMIOS_2_CH12_H_O
#undef PTF12_LPSPI3_SIN_I
#undef PTF12_LPSPI3_SIN_O
#undef PTF12_LPUART10_TX_I
#undef PTF12_LPUART10_TX_O
#undef PTF13_ADC0_MA1
#undef PTF13_EIRQ21
#undef PTF13_EMIOS_2_CH13_H_I
#undef PTF13_EMIOS_2_CH13_H_O
#undef PTF13_LPSPI3_SCK_I
#undef PTF13_LPSPI3_SCK_O
#undef PTF13_LPUART10_RX
#undef PTF14_CAN1_TX
#undef PTF14_CMP0_OUT
#undef PTF14_EIRQ22
#undef PTF14_EMIOS_2_CH14_H_I
#undef PTF14_EMIOS_2_CH14_H_O
#undef PTF14_FCCU_ERR0
#undef PTF14_FCCU_ERR_IN0
#undef PTF14_FXIO_D3_I
#undef PTF14_FXIO_D3_O
#undef PTF15_CAN1_RX
#undef PTF15_CMP0_RR_ACTIVE
#undef PTF15_EIRQ23
#undef PTF15_EMIOS_2_CH15_H_I
#undef PTF15_EMIOS_2_CH15_H_O
#undef PTF15_FCCU_ERR1
#undef PTF15_FCCU_ERR_IN1
#undef PTF15_LPSPI3_SOUT_I
#undef PTF15_LPSPI3_SOUT_O
#undef PTF16_ADC1_MA0
#undef PTF16_EMIOS_1_CH0_X_I
#undef PTF16_EMIOS_1_CH0_X_O
#undef PTF16_EMIOS_2_CH16_X_I
#undef PTF16_EMIOS_2_CH16_X_O
#undef PTF16_LPSPI3_PCS0_I
#undef PTF16_LPSPI3_PCS0_O
#undef PTF16_LPUART12_TX_I
#undef PTF16_LPUART12_TX_O
#undef PTF17_ADC1_MA1
#undef PTF17_EMIOS_1_CH1_H_I
#undef PTF17_EMIOS_1_CH1_H_O
#undef PTF17_EMIOS_2_CH17_Y_I
#undef PTF17_EMIOS_2_CH17_Y_O
#undef PTF17_LPUART12_RX
#undef PTF18_ADC1_MA2
#undef PTF18_EMIOS_1_CH2_H_I
#undef PTF18_EMIOS_1_CH2_H_O
#undef PTF18_EMIOS_2_CH18_Y_I
#undef PTF18_EMIOS_2_CH18_Y_O
#undef PTF18_LPSPI3_PCS1_I
#undef PTF18_LPSPI3_PCS1_O
#undef PTF18_LPUART7_TX_I
#undef PTF18_LPUART7_TX_O
#undef PTF19_ADC0_MA2
#undef PTF19_EMIOS_1_CH3_H_I
#undef PTF19_EMIOS_1_CH3_H_O
#undef PTF19_EMIOS_2_CH19_Y_I
#undef PTF19_EMIOS_2_CH19_Y_O
#undef PTF19_HSE_TAMPER_LOOP_OUT0
#undef PTF19_LPSPI3_PCS2_I
#undef PTF19_LPSPI3_PCS2_O
#undef PTF19_LPUART7_RX
#undef PTF1_EIRQ1
#undef PTF1_EMIOS_2_CH1_H_I
#undef PTF1_EMIOS_2_CH1_H_O
#undef PTF1_LPSPI2_SIN_I
#undef PTF1_LPSPI2_SIN_O
#undef PTF1_LPUART5_RX
#undef PTF20_CAN0_TX
#undef PTF20_EMIOS_1_CH4_H_I
#undef PTF20_EMIOS_1_CH4_H_O
#undef PTF20_EMIOS_2_CH20_Y_I
#undef PTF20_EMIOS_2_CH20_Y_O
#undef PTF20_FXIO_D4_I
#undef PTF20_FXIO_D4_O
#undef PTF20_LPI2C0_SCL_I
#undef PTF20_LPI2C0_SCL_O
#undef PTF20_LPSPI3_PCS3_I
#undef PTF20_LPSPI3_PCS3_O
#undef PTF20_LPUART8_TX_I
#undef PTF20_LPUART8_TX_O
#undef PTF21_CAN0_RX
#undef PTF21_EMIOS_1_CH5_H_I
#undef PTF21_EMIOS_1_CH5_H_O
#undef PTF21_EMIOS_2_CH21_Y_I
#undef PTF21_EMIOS_2_CH21_Y_O
#undef PTF21_FXIO_D5_I
#undef PTF21_FXIO_D5_O
#undef PTF21_LPI2C0_SDA_I
#undef PTF21_LPI2C0_SDA_O
#undef PTF21_LPSPI1_PCS0_I
#undef PTF21_LPSPI1_PCS0_O
#undef PTF21_LPUART8_RX
#undef PTF22_EMIOS_1_CH6_H_I
#undef PTF22_EMIOS_1_CH6_H_O
#undef PTF22_EMIOS_2_CH22_X_I
#undef PTF22_EMIOS_2_CH22_X_O
#undef PTF22_LPSPI4_PCS2_I
#undef PTF22_LPSPI4_PCS2_O
#undef PTF23_EMIOS_1_CH7_H_I
#undef PTF23_EMIOS_1_CH7_H_O
#undef PTF23_EMIOS_2_CH23_X_I
#undef PTF23_EMIOS_2_CH23_X_O
#undef PTF23_LPSPI3_PCS3_I
#undef PTF23_LPSPI3_PCS3_O
#undef PTF23_LPUART9_TX_I
#undef PTF23_LPUART9_TX_O
#undef PTF24_EMIOS_1_CH8_X_I
#undef PTF24_EMIOS_1_CH8_X_O
#undef PTF24_LPUART9_RX
#undef PTF25_CAN2_TX
#undef PTF25_EMIOS_1_CH9_H_I
#undef PTF25_EMIOS_1_CH9_H_O
#undef PTF25_FXIO_D6_I
#undef PTF25_FXIO_D6_O
#undef PTF25_LPSPI2_PCS2_I
#undef PTF25_LPSPI2_PCS2_O
#undef PTF25_LPSPI4_PCS0_I
#undef PTF25_LPSPI4_PCS0_O
#undef PTF26_CAN2_RX
#undef PTF26_EMIOS_1_CH10_H_I
#undef PTF26_EMIOS_1_CH10_H_O
#undef PTF26_LPSPI2_PCS3_I
#undef PTF26_LPSPI2_PCS3_O
#undef PTF26_LPSPI4_PCS1_I
#undef PTF26_LPSPI4_PCS1_O
#undef PTF27_EMIOS_1_CH11_H_I
#undef PTF27_EMIOS_1_CH11_H_O
#undef PTF27_LPSPI4_PCS2_I
#undef PTF27_LPSPI4_PCS2_O
#undef PTF27_LPUART11_TX_I
#undef PTF27_LPUART11_TX_O
#undef PTF28_EMIOS_1_CH12_H_I
#undef PTF28_EMIOS_1_CH12_H_O
#undef PTF28_FXIO_D7_I
#undef PTF28_FXIO_D7_O
#undef PTF28_LPSPI0_PCS0_I
#undef PTF28_LPSPI0_PCS0_O
#undef PTF28_LPSPI4_PCS3_I
#undef PTF28_LPSPI4_PCS3_O
#undef PTF28_LPUART11_RX
#undef PTF28_TRACE_ETM_D5
#undef PTF29_ADC1_MA0
#undef PTF29_CAN3_TX
#undef PTF29_EMIOS_1_CH13_H_I
#undef PTF29_EMIOS_1_CH13_H_O
#undef PTF29_FXIO_D8_I
#undef PTF29_FXIO_D8_O
#undef PTF29_LPSPI3_PCS1_I
#undef PTF29_LPSPI3_PCS1_O
#undef PTF2_EIRQ2
#undef PTF2_EMIOS_2_CH2_H_I
#undef PTF2_EMIOS_2_CH2_H_O
#undef PTF2_LPSPI2_SOUT_I
#undef PTF2_LPSPI2_SOUT_O
#undef PTF2_LPUART6_TX_I
#undef PTF2_LPUART6_TX_O
#undef PTF30_ADC1_MA1
#undef PTF30_CAN3_RX
#undef PTF30_EMIOS_1_CH14_H_I
#undef PTF30_EMIOS_1_CH14_H_O
#undef PTF31_ADC1_MA2
#undef PTF31_EMIOS_1_CH15_H_I
#undef PTF31_EMIOS_1_CH15_H_O
#undef PTF31_FXIO_D9_I
#undef PTF31_FXIO_D9_O
#undef PTF31_TRACE_ETM_D3
#undef PTF3_EIRQ3
#undef PTF3_EMIOS_2_CH3_H_I
#undef PTF3_EMIOS_2_CH3_H_O
#undef PTF3_LPSPI2_PCS0_I
#undef PTF3_LPSPI2_PCS0_O
#undef PTF3_LPUART6_RX
#undef PTF4_CAN5_TX
#undef PTF4_EIRQ4
#undef PTF4_EMIOS_2_CH4_H_I
#undef PTF4_EMIOS_2_CH4_H_O
#undef PTF4_FXIO_D0_I
#undef PTF4_FXIO_D0_O
#undef PTF5_CAN5_RX
#undef PTF5_EIRQ5
#undef PTF5_EMIOS_2_CH5_H_I
#undef PTF5_EMIOS_2_CH5_H_O
#undef PTF6_EIRQ6
#undef PTF6_EMIOS_2_CH6_H_I
#undef PTF6_EMIOS_2_CH6_H_O
#undef PTF7_EIRQ7
#undef PTF7_EMIOS_2_CH7_H_I
#undef PTF7_EMIOS_2_CH7_H_O
#undef PTF7_FXIO_D1_I
#undef PTF7_FXIO_D1_O
#undef PTF7_LPI2C1_SCL_I
#undef PTF7_LPI2C1_SCL_O
#undef PTF8_EIRQ16
#undef PTF8_EMIOS_2_CH8_X_I
#undef PTF8_EMIOS_2_CH8_X_O
#undef PTF8_FXIO_D2_I
#undef PTF8_FXIO_D2_O
#undef PTF8_LPI2C1_SDA_I
#undef PTF8_LPI2C1_SDA_O
#undef PTF9_ADC0_MA0
#undef PTF9_EIRQ17
#undef PTF9_EMIOS_2_CH9_H_I
#undef PTF9_EMIOS_2_CH9_H_O
#undef PTG0_EIRQ8
#undef PTG0_EMIOS_1_CH16_X_I
#undef PTG0_EMIOS_1_CH16_X_O
#undef PTG0_LPUART13_TX_I
#undef PTG0_LPUART13_TX_O
#undef PTG10_EIRQ26
#undef PTG11_EIRQ27
#undef PTG12_EIRQ28
#undef PTG12_LPSPI4_PCS3_I
#undef PTG12_LPSPI4_PCS3_O
#undef PTG13_CAN5_TX
#undef PTG13_EIRQ29
#undef PTG13_FXIO_D13_I
#undef PTG13_FXIO_D13_O
#undef PTG14_CAN5_RX
#undef PTG14_EIRQ30
#undef PTG15_EIRQ31
#undef PTG15_EMIOS_2_CH15_H_I
#undef PTG15_EMIOS_2_CH15_H_O
#undef PTG15_FXIO_D14_I
#undef PTG15_FXIO_D14_O
#undef PTG15_TRACE_ETM_D1
#undef PTG16_EMIOS_2_CH16_X_I
#undef PTG16_EMIOS_2_CH16_X_O
#undef PTG16_FXIO_D15_I
#undef PTG16_FXIO_D15_O
#undef PTG16_TRACE_ETM_D2
#undef PTG17_EMIOS_2_CH17_Y_I
#undef PTG17_EMIOS_2_CH17_Y_O
#undef PTG17_FXIO_D16_I
#undef PTG17_FXIO_D16_O
#undef PTG17_TRACE_ETM_D4
#undef PTG18_EMIOS_2_CH18_Y_I
#undef PTG18_EMIOS_2_CH18_Y_O
#undef PTG18_FXIO_D17_I
#undef PTG18_FXIO_D17_O
#undef PTG18_TRACE_ETM_D6
#undef PTG19_EMIOS_2_CH19_Y_I
#undef PTG19_EMIOS_2_CH19_Y_O
#undef PTG19_FXIO_D18_I
#undef PTG19_FXIO_D18_O
#undef PTG19_TRACE_ETM_D7
#undef PTG1_EIRQ9
#undef PTG1_EMIOS_1_CH17_Y_I
#undef PTG1_EMIOS_1_CH17_Y_O
#undef PTG1_LPUART13_RX
#undef PTG20_EMIOS_2_CH20_Y_I
#undef PTG20_EMIOS_2_CH20_Y_O
#undef PTG20_FXIO_D19_I
#undef PTG20_FXIO_D19_O
#undef PTG20_TRACE_ETM_D8
#undef PTG21_EMIOS_2_CH21_Y_I
#undef PTG21_EMIOS_2_CH21_Y_O
#undef PTG21_FXIO_D20_I
#undef PTG21_FXIO_D20_O
#undef PTG21_TRACE_ETM_D9
#undef PTG22_EMIOS_2_CH22_X_I
#undef PTG22_EMIOS_2_CH22_X_O
#undef PTG22_FXIO_D21_I
#undef PTG22_FXIO_D21_O
#undef PTG22_TRACE_ETM_D10
#undef PTG23_EMIOS_2_CH23_X_I
#undef PTG23_EMIOS_2_CH23_X_O
#undef PTG23_FXIO_D22_I
#undef PTG23_FXIO_D22_O
#undef PTG23_TRACE_ETM_D11
#undef PTG24_FXIO_D23_I
#undef PTG24_FXIO_D23_O
#undef PTG24_TRACE_ETM_D12
#undef PTG25_FXIO_D24_I
#undef PTG25_FXIO_D24_O
#undef PTG25_TRACE_ETM_D13
#undef PTG26_FXIO_D25_I
#undef PTG26_FXIO_D25_O
#undef PTG26_TRACE_ETM_D14
#undef PTG27_FXIO_D26_I
#undef PTG27_FXIO_D26_O
#undef PTG27_TRACE_ETM_D15
#undef PTG2_EIRQ10
#undef PTG2_EMIOS_1_CH18_Y_I
#undef PTG2_EMIOS_1_CH18_Y_O
#undef PTG2_LPUART14_TX_I
#undef PTG2_LPUART14_TX_O
#undef PTG3_EIRQ11
#undef PTG3_EMIOS_1_CH19_Y_I
#undef PTG3_EMIOS_1_CH19_Y_O
#undef PTG3_LPUART14_RX
#undef PTG4_CMP2_OUT
#undef PTG4_EIRQ12
#undef PTG4_EMIOS_1_CH20_Y_I
#undef PTG4_EMIOS_1_CH20_Y_O
#undef PTG4_LPUART15_TX_I
#undef PTG4_LPUART15_TX_O
#undef PTG5_CMP2_RR_ACTIVE
#undef PTG5_EIRQ13
#undef PTG5_EMIOS_1_CH21_Y_I
#undef PTG5_EMIOS_1_CH21_Y_O
#undef PTG5_LPUART15_RX
#undef PTG6_EIRQ14
#undef PTG6_EMIOS_1_CH22_X_I
#undef PTG6_EMIOS_1_CH22_X_O
#undef PTG6_FXIO_D10_I
#undef PTG6_FXIO_D10_O
#undef PTG6_TRACE_ETM_CLKOUT
#undef PTG7_EIRQ15
#undef PTG7_EMIOS_1_CH23_X_I
#undef PTG7_EMIOS_1_CH23_X_O
#undef PTG7_FXIO_D11_I
#undef PTG7_FXIO_D11_O
#undef PTG7_TRACE_ETM_D0
#undef PTG8_CAN4_TX
#undef PTG8_EIRQ24
#undef PTG8_FXIO_D12_I
#undef PTG8_FXIO_D12_O
#undef PTG9_CAN4_RX
#undef PTG9_EIRQ25

#endif /* _ZEPHYR_DTS_BINDING_S32K344_K324_K314_172HDQFP_WRAPPER_ */
